{
  "posts": [

{
  "id": "post_1766395947756",
  "slug": "dhurandhar-box-office-update-ranveer-singh-starrer-storms-past-rs-500-crore-after-massive-third-week",
  "title": "Dhurandhar Box Office Update: Ranveer Singh starrer storms past Rs 500 crore after massive third weekend",
  "summary": "Ranveer Singh’s Dhurandhar continues its extraordinary theatrical run, raking in around Rs 36 crore nett on its third Sunday alone.\nWith this surge, the film has crossed the Rs 500 crore nett mark in just 17 days, taking its domestic total to approximately Rs 528.5 crore.\nThe third weekend has rewritten record books for Hindi cinema, comfortably surpassing the previous benchmark set by Chhaava.\nIt has also broken long-standing All-India records held by Baahubali 2, delivering historic daily and weekend figures.\nDespite facing competition from Avatar: Fire and Ash, the film’s momentum remains unaffected.\nIndustry estimates suggest Dhurandhar could cross Rs 600 crore by the end of week three and challenge Pushpa 2 (Hindi) for the all-time domestic crown, with Rs 800 crore still a distant but possible target.",
  "category": "movies",
  "publishDate": "2025-12-22",
  "sourceName": "Pinkvilla",
  "sourceUrl": "https://www.pinkvilla.com/entertainment/box-office/dhurandhar-box-office-collections-ranveer-singh-film-tops-500-crore-with-a-colossal-third-weekend-1399330"
},
    {
  "id": "post_1766405266967",
  "slug": "awarapan-2-kicks-off-with-emraan-hashmi-disha-patani-set-for-extended-bangkok-shoot",
  "title": "Awarapan 2 kicks off with Emraan Hashmi, Disha Patani set for extended Bangkok shoot",
  "summary": "Emraan Hashmi and Disha Patani are all set to begin work on Awarapan 2, with filming starting this week in Bangkok.\nThe makers have planned an intensive month-long schedule in the city, during which more than half of the film will be shot.\nSources say the central conflict of the sequel unfolds in Bangkok, prompting the team to film extensively at real locations.\nProducer Vishesh Bhatt is simultaneously focusing on developing a strong music album, keeping in line with the franchise’s musical legacy.\nAfter wrapping the Bangkok leg, the cast and crew will regroup for another schedule in November, aiming to complete filming by January 2026.\nThe film remains locked for an April 3, 2026 release, with Hashmi returning as Shivam and Disha Patani stepping into the world of this intense romantic drama.",
  "category": "movies",
  "publishDate": "2025-12-22",
  "sourceName": "Pinkvilla",
  "sourceUrl": "https://www.pinkvilla.com/entertainment/exclusives/exclusive-emraan-hashmi-and-disha-patani-gear-up-for-a-month-long-schedule-of-awarapan-2-in-bangkok-1397123"
 },
    {
  "id": "post_1766414996554",
  "slug": "bollywood-stars-shower-salman-khan-with-admiration-ahead-of-his-60th-birthday",
  "title": "Bollywood stars shower Salman Khan with admiration ahead of his 60th birthday",
  "summary": "As Salman Khan prepares to turn 60, voices from across Bollywood have come together to celebrate the actor’s enduring influence in the industry. In an environment where equations often change, Salman’s relationships have remained remarkably steady, earning him respect across generations. Many colleagues point out that his impact goes far beyond box office numbers, highlighting his loyalty, generosity, and long-standing personal bonds.\nBobby Deol has often spoken about Salman’s deep connection with his family, especially his affection and respect for Dharmendra. He has described Salman as someone who has always stood by them, noting that the superstar carries no insecurity and forms relationships that extend well beyond professional boundaries.\nAmong his peers, Salman also commands admiration from fellow superstars. Shah Rukh Khan has openly acknowledged looking up to both Salman and Aamir Khan, crediting their journeys, resilience, and body of work as deeply inspiring. Aamir Khan, on the other hand, has frequently praised Salman’s acting ability, citing performances like Bajrangi Bhaijaan and Dabangg as examples of his natural screen presence and emotional range.\nActors who have collaborated closely with Salman often credit him for shaping key moments in their careers. Jacqueline Fernandez has called her association with him a turning point, saying films like Kick opened new doors for her. Katrina Kaif has also spoken about Salman’s guidance during her early years, describing him as a constant source of support and an important figure in her personal and professional journey.\nTogether, these tributes paint a picture of Salman Khan not just as a megastar, but as a figure whose influence, mentorship, and personal connections have left a lasting mark on Bollywood.",
  "category": "relationships",
  "publishDate": "2025-12-22",
  "sourceName": "Filmibeat",
  "sourceUrl": "https://www.filmibeat.com/bollywood/news/2025/bollywood-celebs-sing-praise-for-salman-khan-ahead-of-his-60th-birthday-011-493796.html"
    },
    {
  "id": "post_1766415120916",
  "slug": "rita-bhattacharya-responds-to-kumar-sanus-rs-50-crore-defamation-case-appeals-for-calm",
  "title": "Rita Bhattacharya responds to Kumar Sanu’s Rs 50 crore defamation case, appeals for calm",
  "summary": "Singer Kumar Sanu has approached the Bombay High Court with a defamation suit against his former wife Rita Bhattacharya, alleging that her recent media remarks damaged his reputation.\nThe petition reportedly seeks Rs 50 crore in damages and calls for the removal of interviews that allegedly violate a non-disparagement clause from their 2001 divorce settlement.\nBreaking her silence, Bhattacharya said she was stunned by the scale of the legal demand and questioned how such a sum could be expected from her.\nShe also claimed that repeated attempts by her and her children to contact Sanu over the years were blocked, leaving no scope for dialogue.\nThe dispute follows public exchanges earlier this year linked to media comments and social media reactions involving their son, Jaan Sanu.\nBhattacharya stated she is prepared to face the case in court and made an emotional appeal for peace, urging Sanu to stop what she described as continued harassment",
  "category": "controversy",
  "publishDate": "2025-12-22",
  "sourceName": "Bollywood Hungama",
  "sourceUrl": "https://www.bollywoodhungama.com/news/bollywood/rita-bhattacharya-breaks-silence-kumar-sanus-rs-50-crores-defamation-suit-calls-peace/"
    },
    {
  "id": "post_1766415231197",
  "slug": "drishyam-3-officially-announced-ajay-devgn-reprises-vijay-salgaonkar",
  "title": "Drishyam 3 officially announced; Ajay Devgn reprises Vijay Salgaonkar",
  "summary": "The makers of Drishyam 3 have unveiled an announcement video, confirming the return of Ajay Devgn as Vijay Salgaonkar in the final chapter of the hit thriller franchise.\nShared on social media, the video announces an October 2, 2026 theatrical release and teases the story’s concluding act.\nDevgn is seen delivering an intense monologue that reflects Vijay’s belief system, centred firmly on protecting his family at all costs.\nThe clip blends moments from the earlier films with fresh visuals, hinting at new twists and moral conflicts ahead.\nThe announcement follows Devgn’s recent promise that a major update on Drishyam 3 would arrive in December.\nMeanwhile, the Malayalam version led by Mohanlal has already wrapped, with both versions progressing in parallel.\nAlongside Devgn, the Hindi film features Tabu, Shriya Saran, Ishita Dutta, Mrunal Jadhav, Kamlesh Sawant and Rajat Kapoor.",
  "category": "movies",
  "publishDate": "2025-12-22",
  "sourceName": "Bollywood Hungama",
  "sourceUrl": "https://www.bollywoodhungama.com/news/bollywood/drishyam-3-announcement-video-drops-ajay-devgn-returns-vijay-salgaonkar/"
    }
  
  
  
  
  
  
  
  
  
  ]
}
